//TODO Функция смещения кубика должна возвращать успех или не успех.

//TODO Нужна ещё функция поворота кубика относительно с заданного центра с абсолютными координатами.Когда задаются координаты и кубика и центра

// Может быть ситуация, когда фигура просто удаляетcя вся в произвольном месте и новая появляется не сразу

//! ERR Ошибка с отрисовкой правой стенки стакана х + 1 - проверить!!

//TODO Консольная графика!

//Графика:
//Нарисовать линию заданной толщины(прямоугольник)
//Нарисовать квадратик
//Написать текст относительно точки центра
//Написать текст относительно базовой точки
//Стереть текст
//Стереть квадратик
//Задать цвет фона в окне
//Нарисовать фигуру
//Стереть фигуру
//Нарисовать нижние слои
//Стереть нижние слои

//Такт :
//Отрисовка нового
//Обработка, вычисления и пауза
//Стирание старого

//TODO Обсчет таймера - так, чтобы выполнялся такт в 1 / 30 или 1 / 60 секунды

//Такт игры - кратен тактам отрисовки.

//Если появившаяся фигура касается нижних слоев или накрывает их - игра закончена.

//TODO Все перемещения и повороты фигуры с проверкой

//TODO Проверка касания нижних слоев вертикально

//TODO Проверка касания вообще, слева - справа и по диагонали

