// @file: types.cpp
//

#include "types.h"

// Типы фигур (Массивы смещений для каждого кубика)
std::vector<std::vector<Point>> figTypes =
{ //   X  Y
	{ {0, 0} },								// 0. Одиночный кубик
	{ {0, 0}, {0, 1} },						// 1. Палка из 2 кубиков
	{ {0, 0}, {0, 1}, {0, -1} },			// 2. Палка из 3 кубиков
	{ {0, 0}, {0, 1}, {1, 0} },				// 3. Уголок
	{ {0, 0}, {0, 1}, {1, 0}, {1, 1} },		// 4. Квадратик
	{ {0, 0}, {0, 1}, {0, -1}, {0, 2} },	// 5. Палка из 4 кубиков
	{ {0, 0}, {-1, 0}, {1, 0}, {0, 1} },	// 6. Буква Т
	{ {0, 0}, {1, 0}, {0, 1}, {-1, 1} },	// 7. Буква Z 
	{ {0, 0}, {-1, 0}, {0, 1}, {1, 1} },	// 8. Буква S 
	{ {0, 0}, {1, 0}, {0, 1}, {0, 2} },		// 9. Буква L
	{ {0, 0}, {-1, 0}, {0, 1}, {0, 2} },	// 10. Буква J
	// Дальше - фигуры Пентамино - из 5
	{ {0, 0}, {-1, 0}, {1, 0}, {0, 1}, {0, -1} },	// 11. Крестик
	{ {0, 0}, {0, 1}, {0, 2}, {0, -1}, {0, -2} },	// 12. Палка из 5 кубиков
};

// Типы фигур (Массивы расстояний до краев фигур)
std::vector<figSize> figSizes =
{ // L  R  U  D
	{0, 0, 0, 0}, // 0. Одиночный кубик
	{0, 0, 1, 0}, // 1. Палка из 2 кубиков
	{0, 0, 1, 1}, // 2. Палка из 3 кубиков
	{0, 1, 1, 0}, // 3. Уголок
	{0, 1, 1, 0}, // 4. Квадратик
	{0, 0, 2, 1}, // 5. Палка из 4 кубиков
	{1, 1, 1, 0}, // 6. Буква Т
	{1, 1, 1, 0}, // 7. Буква Z
	{1, 1, 1, 0}, // 8. Буква S
	{0, 1, 2, 0}, // 9. Буква L
	{1, 0, 2, 0}, // 10. Буква J
	{1, 1, 1, 1}, // 11. Крестик
	{0, 0, 2, 2}, // 12. Палка из 5 кубиков
};
